import { Component, CUSTOM_ELEMENTS_SCHEMA } from '@angular/core';
import { TranslateModule } from '@ngx-translate/core';
import { ReviewsComponent } from './reviews/reviews.component';
import { CommonModule } from '@angular/common';
import { Navigation, Pagination, EffectCoverflow } from "swiper/modules";
import { ContactFormComponent } from "../../shared/components/contact-form/contact-form.component";

@Component({
  selector: 'app-home',
  standalone: true,
  templateUrl: './home.component.html',
  styleUrls: ['./home.component.scss'],
  imports: [
    TranslateModule,
    CommonModule,
    ReviewsComponent,
    ContactFormComponent,
  ],
  schemas: [CUSTOM_ELEMENTS_SCHEMA],
})
export class HomeComponent {
  videoLoaded = false;

  swiperConfig = {
    effect: 'coverflow',
    grabCursor: true,
    centeredSlides: true,
    slidesPerView: 1,
    loop: true,
    slideToClickedSlide: true,
    coverflowEffect: {
      rotate: 30,
      stretch: 80,
      depth: 200,
      modifier: 1.5,
      slideShadows: false,
    },
    modules: [EffectCoverflow, Pagination, Navigation],
  };

  onVideoLoaded() {
    this.videoLoaded = true;
  }


  slides = [
    { text: 'Відчуваєш постійний стрес від роботи і потребуєш відновлення', img: './assets/img/its-for-you/5.png' },
    { text: 'Ти працюєш з іншими людьми і потребуєш глибокого перезавантаження', img: './assets/img/its-for-you/2.png' },
    { text: 'Тимчасово працюєш на заводі і хочеш змінити своє життя', img: './assets/img/its-for-you/3.png' },
    { text: 'Шукаєш натхнення та нові ідеї', img: './assets/img/its-for-you/4.png' },
    { text: 'Ти потребуєш особистого простору та часу для відновлення', video: './assets/img/its-for-you/1.mp4' },
    { text: 'Ти прагнеш до глибокої трансформації та розвитку', img: './assets/img/its-for-you/6.png' },
    { text: 'Шукаєш спосіб з\'єднатися з природою та повернути гармонію в своєму житті', img: './assets/img/its-for-you/7.png' },
    { text: 'Шукаєш можливість розширити своє коло знайомств з однодумцями', img: './assets/img/its-for-you/8.png' }
  ];

  faq = [
    {
      title: '📍 Де проходить ретрит?',
      content: ['Наш йога-ретрит проходить на острові Балі – у місці, де природа, енергетичні місця сили та особлива атмосфера створюють ідеальні умови для глибокого перезавантаження.'],
      isOpen: true
    },
    {
      title: '🗓 На які дати можна записатися?',
      content: ['24.07 - 03.08', '6.08 - 16.08'],
      isOpen: false
    },
    {
      title: '👩‍💼 Для кого цей ретрит?',
      content: [
        'Бізнес-леді та IT-спеціалістки, які хочуть відпочити від стресу й отримати нові ідеї.',
        'Психологи і спеціалісти із саморозвитку, які завжди допомагають іншим, але самі потребують відновлення.',
        'Усі, хто тимчасово працює на заводі, але мріє про більше та хоче знайти свій шлях.'
      ],
      isOpen: false
    },
    {
      title: '🧘 Що входить у програму ретриту?',
      content: [
        'Щоденні практики йоги та медитації',
        'Глибокі трансформаційні сесії',
        'Подорожі до місць сили',
        'Масажі, SPA та балійські ритуали очищення',
        'Відпочинок на океані та екзотична кухня',
        'Нові знайомства та тепле коло однодумців'
      ],
      isOpen: false
    },
    {
      title: '✈ Як відбувається зустріч в аеропорту?',
      content: ['Ми зустрінемо вас в аеропорту, організуємо комфортний трансфер до вілли та допоможемо з адаптацією. Уже першого вечора на вас чекає вечеря-знайомство в колі учасниць.'],
      isOpen: false
    },
    {
      title: '🍉 Яке харчування передбачено?',
      content: [
        'Свіжі екзотичні фрукти',
        'Поживні сніданки',
        'Вегетаріанські страви (за бажанням)',
        'Святкові вечері з морепродуктами на заході сонця'
      ],
      isOpen: false
    },
    {
      title: '🎒 Що з собою брати?',
      content: [
        'Легкий одяг для практик йоги',
        'Купальник та сонцезахисний крем',
        'Зручне взуття для прогулянок',
        'Особистий блокнот для запису усвідомлень'
      ],
      isOpen: false
    },
    {
      title: '💰 Яка вартість ретриту?',
      content: ['Вартість залежить від вибраного типу проживання. Щоб дізнатися деталі, залиште заявку, і ми надішлемо всю інформацію.'],
      isOpen: false
    },
    {
      title: '📩 Як записатися?',
      content: ['Записатися можна, заповнивши форму або написавши нам у direct. Кількість місць обмежена!'],
      isOpen: false
    }
  ];


  // вфні

  days = [
    {
      title: 'Програма 1-го дня',
      content: [
        'Приліт і зустріч в аеропорту',
        'Трансфер і заселення у віллу',
        'Відпочинок, знайомство з простором',
        'Вечеря-знайомство в колі учасниць',
        'Створення наміру на ретрит',
        "М'які практики на зближення та довіру",
        'Завершення дня у розслабленій атмосфері'
      ],
      isOpen: true
    },
    {
      title: 'Програма 2-го дня',
      content: [
        "М'яка ранкова йога",
        'Трансформаційна медитація: Зцілення родових сценаріїв',
        'Сніданок: Корисні страви, фрукти, смузі',
        'Купання в океані та відпочинок на пляжі',
        'Вільний час: обід, природа, спілкування',
        'Масаж на віллі з ароматними оліями',
        'Вечірній відпочинок: вечеря, чайна церемонія, особисті практики'
      ],
      isOpen: false
    },
    {
      title: 'Програма 3-го дня',
      content: [
        'Ранній виїзд до храму Пура Танах Лот',
        'Йога та трансформаційна медитація',
        'Сніданок на віллі',
        'Відпочинок і купання в океані',
        'Обід',
        'Поїздка в баню: ароматерапія, сакральний танець, чаювання',
        'Вечеря в ресторані'
      ],
      isOpen: false
    },
    {
      title: 'Програма 4-го дня',
      content: [
        'Йога та медитація на сході сонця',
        'Сніданок та купання в океані',
        'Переїзд в Убуд',
        'Заселення на віллу та обід',
        'Вечірнє шоу «Лемурія»',
        'Вечеря в ресторані',
        'Прогулянка по Убуду'
      ],
      isOpen: false
    },
    {
      title: 'Програма 5-го дня',
      content: [
        "М'яка ранкова йога та дихальна практика",
        'Медитація: Активізація енергії достатку',
        'Сніданок: Поживні страви, фрукти, смузі',
        'Поїздка на церемонію «Мелукат» – ритуал очищення',
        'Обід',
        'Розстановки – глибока робота із запитами',
        'Вечеря в ресторані та прогулянка'
      ],
      isOpen: false
    },
    {
      title: 'Програма 6-го дня',
      content: [
        'Ранній підйом',
        'Сніданок на рисових терасах',
        'Катання на гойдалках, фото та відео з дрона',
        'Обід у місцевому кафе',
        'Повернення на віллу та відпочинок',
        'Вечеря в ресторані',
        'Трансформаційна гра «Ліла»'
      ],
      isOpen: false
    },
    {
      title: 'Програма 7-го дня',
      content: [
        "М'яка ранкова йога та дихальна практика",
        'Медитація: Активізація енергії достатку',
        'Відвідування водоспаду',
        'Сніданок',
        'Час на інтеграцію та усвідомлення',
        'Заключне коло',
        'Підготовка до від’їзду та трансфер в аеропорт'
      ],
      isOpen: false
    },
    {
      title: 'Програма 8-го дня',
      content: [
        'Ранкова йога та м\'яка розтяжка',
        'Трансформаційна медитація: Активізація енергії достатку',
        'Практика саундхілінгу',
        'Вільний час і прогулянки'
      ],
      isOpen: false
    },
    {
      title: 'Програма 9-го дня',
      content: [
        'Ранкова йога та дихальні практики',
        'Медитація: Гармонізація жіночої та чоловічої енергій',
        'Поїздка на майстер-клас зі срібних прикрас',
        'Створення прикраси на згадку про ретрит',
        'Відвідування Балі Дачі'
      ],
      isOpen: false
    },
    {
      title: 'Програма 10-го дня',
      content: [
        'М\'яка йога',
        'Трансформаційна медитація: Створення щасливого майбутнього',
        'Поїздка в Нуану',
        'Біч-клуб Luna',
        'Вечірня дискотека, діджей, шоу'
      ],
      isOpen: false
    },
    {
      title: 'Програма 11-го дня',
      content: [
        'М\'яка йога та дихальні практики',
        'Поживний сніданок',
        'Тепле прощання',
        'Трансфер до аеропорту'
      ],
      isOpen: false
    }
  ];


  // Метод для відкриття/закриття вкладки
  toggleAccordion(day: any) {
    this.days.forEach(d => d.isOpen = false)
    day.isOpen = !day.isOpen;
  }
}
